Repository: ltrgithub/X3GestAA
Catalog: translation-indexes/messages_Syracuse.tmx
Source language: en_us
Languages: de_de, es_es, fr_fr, pt_pt, zh_cn

source: Too many constants
de_de: Zu viele Konstanten
es_es: Demasiadas constantes
fr_fr: Trop de constantes
pt_pt: Demasiadas constantes
zh_cn: 常数过多

source: Table or view unreachable
de_de: Tabelle oder Ansicht unerreichbar
es_es: Tabla o vista inaccesible
fr_fr: Table ou vue inaccessible
pt_pt: Tabela ou view inacessível
zh_cn: 无法访问表或视图

source: File does not exist in the archive
de_de: Datei im Archiv nicht vorhanden
es_es: Fichero inexistente en el archivo
fr_fr: Fichier inexistant dans l'archive
pt_pt: Ficheiro inexistente no arquivo
zh_cn: 文件不存在于存档中

source: User or role does not exist
de_de: Benutzer oder Rolle nicht vorhanden
es_es: Usuario o rol inexistente
fr_fr: Utilisateur ou rôle inexistant
pt_pt: Utilizador ou papel inexistente
zh_cn: 用户或角色不存在

source: The variable must be a structure
de_de: Die Variable muss eine Struktur sein
es_es: La variable debe ser una estructura
fr_fr: La variable doit être une structure
pt_pt: A variável deve ser uma estrutura
zh_cn: 该变量必须是一个结构

source: Operation not on a field structure ,
de_de: Aktion nicht in einer Feldstruktur möglich
es_es: Operación imposible en un campo de estructura
fr_fr: Opération impossible sur un champ de structure
pt_pt: Operação impossível num campo de estrutura
zh_cn: 无法在一个结构字段上进行操作

source: Member nonexistent structure
de_de: Nicht vorhandene Mitgliedsstruktur
es_es: Miembro de estructura inexistente
fr_fr: Membre de structure inexistant
pt_pt: Membro de estrutura inexistente
zh_cn: 结构构件不存在

source: The label is not a sub-procedure
de_de: Die Markierung ist keine Unterprozedur
es_es: La etiqueta no es una subproceso
fr_fr: L'étiquette n'est pas une sous-procédure
pt_pt: A etiqueta não é um subprocedimento
zh_cn: 该标签不是一个子程序

source: The label is not a method
de_de: Die Markierung ist keine Methode
es_es: La etiqueta no es un método
fr_fr: L'étiquette n'est pas une méthode
pt_pt: A etiqueta não é um método
zh_cn: 该标签不是一个方法

source: No current object
de_de: Kein aktuelles Objekt
es_es: Ningún objeto actual
fr_fr: Aucun objet courant
pt_pt: Nenhum objecto corrente
zh_cn: 没有当前对象

source: ERREUR_XML incorrect XML Document
de_de: ERREUR_XML falsches XML-Dokument
es_es: ERROR_XML Documento XML incorrecto
fr_fr: ERREUR_XML Document XML incorrect
pt_pt: ERREUR_XML documento XML incorreto
zh_cn: ERREUR_XML 错误的XML文档

source: ERREUR_XML not parsable XML Structure
de_de: ERREUR_XML XML-Struktur nicht analysierbar
es_es: ERROR_XML Escrutura XML no interpretable·
fr_fr: ERREUR_XML Structure XML non parsable
pt_pt: ERREUR_XML Estrutura XML não parsable
zh_cn: ERREUR_XML 未解析的XML结构

source: ERREUR_XML unknown Abbreviation
de_de: ERREUR_XML unbekannte Abkürzung
es_es: ERROR_XML Abreviatura desconocida
fr_fr: ERREUR_XML Abréviation inconnue
pt_pt: ERREUR_XML Sigla do desconhecido
zh_cn: ERREUR_XML未知缩写

source: ERREUR_XLM Abbreviation already used
de_de: ERREUR_XLM Abkürzung bereits verwendet
es_es: ERROR_XML Abreviatura ya utilizada
fr_fr: ERREUR_XML Abréviation déjà utilisée
pt_pt: Sigla já utilizado ERREUR_XML
zh_cn: ERREUR_XLM缩写已使用

source: ERREUR_XML Too many open XML file
de_de: ERREUR_XML Zu viele geöffnete XML-Dateien
es_es: ERROR_XML Demasiados ficheros XML abiertos
fr_fr: ERREUR_XML Trop de fichiers XML ouverts
pt_pt: ERREUR_XML Muitos arquivos Open XML
zh_cn: ERREUR_XML打开的XML文件过多

source: ERREUR_XML Node with too many attributes ,
de_de: ERREUR_XML Node mit zu vielen Attributen
es_es: ERROR_XML Nudo con demasiados atributos
fr_fr: ERREUR_XML Noeud avec trop d'attributs
pt_pt: Nó ERREUR_XML com muitos atributos
zh_cn: ERREUR_XML节点属性的过多

source: ERREUR_XML No filename
de_de: ERREUR_XML Kein Dateiname
es_es: ERROR_XML Sin nombre de fichero
fr_fr: ERREUR_XML Pas de nom de fichier
zh_cn: ERREUR_XML 没有文件名

source: ERREUR_XML It lacks the abbreviation
de_de: ERREUR_XML Abkürzung fehlt
es_es: ERROR_XML Falta la abreviatura
fr_fr: ERREUR_XML Il manque l'abréviation
pt_pt: ERREUR_XML a abreviatura ausente
zh_cn: ERREUR_XML缺少缩写

source: ERREUR_XML lacks the node name
de_de: ERREUR_XML Nodename fehlt
es_es: ERROR_XML Falta el nombre del nudo
fr_fr: ERREUR_XML Il manque le nom du noeud
pt_pt: ERREUR_XML faltando o nome do nó
zh_cn: ERREUR_XML缺少节点名称

source: There is no ERREUR_XML node with the name
de_de: ERREUR_XML Kein Node mit diesem Namen vorhanden
es_es: ERROR_XML No existe nudo con este nombre
fr_fr: ERREUR_XML Il n'existe pas de noeud avec ce nom
pt_pt: ERREUR_XML Não há nó com o nome
zh_cn: ERREUR_XML 不存在该名称的节点

source: channel in use
de_de: Kanal in Verwendung
es_es: Canal en curso de utilización
fr_fr: Canal en cours d'utilisation
pt_pt: Canal em curso de utilização
zh_cn: 信道正在使用中

source: UTF8 conversion error
de_de: Konvertierungsfehler UTF8
es_es: Error de conversión UTF8
fr_fr: Erreur de conversion UTF8
pt_pt: Erro de conversão UTF8
zh_cn: UTF8转换出错

source: Number of instructions or expressions too important,
de_de: Anzahl der Anweisungen oder Ausdrücke zu hoch
es_es: Número de instrucciones o de expresiones demasiado importante
fr_fr: Nombre d'instructions ou d'expressions trop important
pt_pt: Nr. de instruções ou expressões demasiado importante
zh_cn: 指令或表达式的数目过多

source: Errors issued by the remote server
de_de: Fehler vom Remote-Server ausgegeben
es_es: Errores emitidos por el servidor remoto
fr_fr: Erreurs emises par le serveur distant
pt_pt: Erros emitidos pelo servidor distante
zh_cn: 由远程服务器发出的错误

source: Communication channel not open
de_de: Kommunikationskanal nicht geöffnet
es_es: Canal de comunicación no abierto
fr_fr: Canal de communication non ouvert
pt_pt: Canal de comunicação não aberto
zh_cn: 未打开通讯信道

source: type parameter dPclaration
de_de: Parametertyp dPclaration
es_es: tipo de declaración parámetro
fr_fr: type de déclaration paramètre
pt_pt: declaração de tipo de parâmetro
zh_cn: 参数dPclaration类型

source: null or invalid Reference
de_de: Keine oder ungültige Referenz
es_es: Referencia nula o no válida
fr_fr: Référence nulle ou non valide
pt_pt: Referência nula ou inválida
zh_cn: 引用为空或无效

source: Abbr off limits
de_de: Abkürzung zu lang
es_es: Abreviatura fuera de límite
fr_fr: Abréviation hors limite
pt_pt: Off abreviatura limites
zh_cn: 禁止的缩写

source: Error serializing
de_de: Fehler Serialisierung
es_es: Error serialización
fr_fr: Erreur sérialisation
pt_pt: Erro de serialização
zh_cn: 序列化错误

source: Saturation of the tree avl
de_de: Sättigung des AVL-Baums
es_es: Saturación del árbol AVL
fr_fr: Saturation de l'arbre AVL
pt_pt: A saturação da árvore AVL
zh_cn: AVL树形图完备性/饱和度

source: Error spe network
de_de: Fehler spe-Netzwerk
es_es: Error spe de red
fr_fr: Erreur spe réseau
pt_pt: Erro de rede Spe
zh_cn: spe网络错误

source: Error XML conversion
de_de: Fehler XML-Konvertierung
es_es: Error conversión XML
fr_fr: Erreur conversion XML
pt_pt: Erro de conversão XML
zh_cn: XML转换错误

source: Error MD5
de_de: Fehler MD5
fr_fr: Erreur MD5
pt_pt: Erro MD5
zh_cn: MD5错误

source: Error writing to socket
de_de: Fehler Schreiben auf Socket
es_es: Error escritura en socket
fr_fr: Erreur écriture sur socket
pt_pt: Erro ao escrever no soquete
zh_cn: 在socket上写入时出错

source: Maximum reached breakpoints
de_de: Maximale Anzahl an Breakpoints erreicht
es_es: Máximo num de breakpoints alcanzado
fr_fr: Maximum de breakpoints atteint
pt_pt: Breakpoints máxima atingida
zh_cn: 达到最大breakpoints数

source: Breakpoint inexistent
de_de: Breakpoint nicht vorhanden
es_es: Breakpoint inexistente
fr_fr: Breakpoint inexistant
pt_pt: Inexistente Breakpoint
zh_cn: Breakpoint不存在

source: Unknownencoding
de_de: Unbekannte Kodierung
es_es: Codificación desconocida
fr_fr: Encodage inconnu
pt_pt: codificação desconhecida
zh_cn: 未知编码

source: Propertyinreadonly
de_de: Eigenschaft schreibgeschützt
es_es: Propiedad en readonly
fr_fr: Propriete en readonly
pt_pt: Imóvel em readonly
zh_cn: 只读属性

source: Nosnapshot
de_de: Kein Snapshot
es_es: Sin snapshot
fr_fr: Pas de snapshot
pt_pt: Nenhum snapshot
zh_cn: 没有快照

source: Typenotloaddata
de_de: Datentyp nicht laden
es_es: Tipo de dato no cargado
fr_fr: Type de donnée non charge
pt_pt: Digite não determinada carga
zh_cn: 非负荷的数据类型

source: Uuidbadformat
de_de: Falsches Uuid-Format
es_es: UUID de formato erróneo
fr_fr: Uuid de mauvais format
pt_pt: Uuid de formato errado
zh_cn: 格式错误的UUID

source: Proceedingreadonly
de_de: Instanz schreibgeschützt
es_es: Instancia en readonly
fr_fr: Instance en readonly
pt_pt: Readonly Instância
zh_cn: 只读实例

source: Returntypeincorrect
de_de: Falscher Rückgabetyp
es_es: Tipo de retorno incorrecto
fr_fr: Type de retour incorrect
pt_pt: Tipo de retorno incorreto
zh_cn: 返回类型不正确

source: Instancesnapshot
de_de: Instanz Snapshot
es_es: Instancia snapshot
pt_pt: Snapshot Instância
zh_cn: 快照实例

source: Atleastoneinstance
de_de: Mindestens eine Instanz
es_es: Al menos una instancia
fr_fr: Au moins une instance
pt_pt: Pelo menos uma instância
zh_cn: 至少一个实例

source: Instance/incoherentgroup
de_de: Inkohärente Instanz/Gruppe
es_es: Instancia/grupo incoherente
fr_fr: Instance/groupe incoherent
pt_pt: Fórum / grupo incoerente
zh_cn: 实例/组不一致

source: Theclassisvirtualdemande
de_de: Die angefragte Klasse ist virtuell
es_es: La clase solicitada es virtual
fr_fr: La classe demandée est virtuelle
pt_pt: A classe solicitada é virtual
zh_cn: 请求分类是虚拟的

source: Tokentoolong
de_de: Token zu lang
es_es: Token demasiado largo
fr_fr: Token trop long
pt_pt: Token demasiado longo
zh_cn: 令牌过长

source: Heapfull
de_de: Heap voll
es_es: Pila llena
fr_fr: Heap plein
pt_pt: Heap
zh_cn: Heap已满

source: authenticationerror
de_de: Authentifizierungsfehler
es_es: Error de autentificación
fr_fr: Erreur d authentification
pt_pt: Erro de autenticação
zh_cn: 身份验证错误

source: FreeInstancebeforesnapshot
de_de: Freie Instanz vor Snapshot
es_es: freeInstance antes snapshot
fr_fr: freeInstance avant snapshot
pt_pt: FreeInstance antes snapshot
zh_cn: 快照之前FreeInstance

source: Putseqdoesnotsupportext
de_de: Putseq unterstützt keine ext
es_es: Putseq no soporta los ext
fr_fr: Putseq ne supporte pas les ext
pt_pt: Não Putseq não suporta ext
zh_cn: Putseq不支持ext

source: incompatibleprotocol
de_de: Protokoll nicht kompatibel
es_es: protocolo incompatible
fr_fr: protocole incompatible
pt_pt: protocolo incompatível
zh_cn: 协议不兼容

source: Validationobject
de_de: Objektvalidierung
es_es: Validación objeto
pt_pt: Objeto de validação
zh_cn: 对象验证

source: InvalidObject
de_de: Ungültiges Objekt
es_es: Objeto no válido
fr_fr: Objet invalide
pt_pt: Objeto inválido
zh_cn: 无效的对象

source: SequenceInvalidcall
de_de: Sequenz falscher Call
es_es: Secuencial de llamada incorrecta
fr_fr: Sequence d'appel incorrecte
pt_pt: Seqüência de chamada inválido
zh_cn: 调用序列不正确

source: Anoperatorisrequired
de_de: Ein Betreiber ist erforderlich
es_es: Se requiere un operador
fr_fr: Un operateur est requis
pt_pt: Um operador é necessária
zh_cn: 要有一个操作员

source: Compilationerror
de_de: Kompilationsfehler
es_es: Compilación error
pt_pt: Erro de compilação
zh_cn: 编译错误

source: The connection with print server failed.
de_de: Die Verbindung mit dem Druckerserver ist fehlgeschlagen.
es_es: La conexión con el servidor de impresion ha fallado.
fr_fr: La connexion avec le serveur d'édition a échouée.
pt_pt: A conexão com a edição do servidor falhou.
zh_cn: 与打印服务器的连接失败。

source: Receiving application
de_de: Anwendung empfangen
es_es: Recepción solicitada
fr_fr: Réception demande
pt_pt: Pedido de recibo
zh_cn: 请求接收

source: Printing is completed.
de_de: Drucken abgeschlossen.
es_es: Impresión terminada
fr_fr: Impression terminée
pt_pt: A impressão é concluída
zh_cn: 打印已完成

source: Read parameters
de_de: Liest Parameter
es_es: Lectura parámetros
fr_fr: Lecture paramètres
pt_pt: Definições de reprodução
zh_cn: 参数读取

source: Waiting for availability of print server
de_de: Auf Verfügbarkeit des Druckerservers warten
es_es: Espera disponibilidad del servidor de impresión
fr_fr: Attente disponibilité du serveur d'impression
pt_pt: Dependendo da disponibilidade do servidor de impressão
zh_cn: 等待打印服务器可用

source: Consideration by the printing process
de_de: Berücksichtigung Druckvorgang
es_es: Tomado en cuenta por el proceso de impresión
fr_fr: Prise en compte par le processus d'impression
pt_pt: Tidos em conta pelo processo de impressão
zh_cn: 被打印进程纳入考虑之列

source: Update Cache
de_de: Cache-Aktualisierung
es_es: Actualización del cache
fr_fr: Mise à jour du cache
pt_pt: Atualização de Cache
zh_cn: 更新缓存

source: Treatment attachments
de_de: Anhänge verarbeiten
es_es: Proceso de documentos adjuntos
fr_fr: Traitement pièces jointes
pt_pt: Tratamento Anexos
zh_cn: 附件处理

source: Taking into account the crystal print engine
de_de: Berücksichtigung Crystal Druckerserver
es_es: Tomado en cuenta por el motor de impresión crystal
fr_fr: Prise en compte par le moteur d'impression crystal
pt_pt: Consideração pelo mecanismo de impressão de cristal
zh_cn: 被水晶打印引擎纳入考虑之列

source: The order '{0}' is not valid. Accepted order are: '{1}'
de_de: Der Auftrag '{0}' ist ungültig. Angenommene Aufträge: '{1}'
es_es: La orden '{0}' no es válido. Las ordenes aceptadas son: '{1}'
fr_fr: L'ordre '{0}' n'est pas valide. Les ordres acceptés sont: '{1}'
pt_pt: A ordem de '{0}' é inválido. As ordens recebidas são: {1} '
zh_cn: 序列'{0}'是无效的。接收的序列为：'{1}'

source: Bad URL: expected 'print', got '{0}'
de_de: Falsche URL: erwartet 'print'; erhalten '{0}'
es_es: URL esperada 'print'; obtenida '{0}'
fr_fr: URL attendue 'print'; obtenue '{0}'
pt_pt: URL esperado 'print'; obtido '{0}'
zh_cn: 预期URL为'print'，收到的为'{0}'

source: unexpected URL segment: {0}
de_de: Unerwartetes URL-Segment: {0}
es_es: Segmento de Url inesperado: {0}
fr_fr: Segment d'Url inattendu: {0}
pt_pt: Segmento Url inesperado: {0}
zh_cn: 意外的URL分段：{0}

source: Unexpected error
de_de: Unerwarteter Fehler
es_es: Error inesperado
fr_fr: Erreur inattendue
pt_pt: Erro inesperado
zh_cn: 意外错误

source: Unknow job
de_de: Unbekannte Aufgabe
es_es: Tarea desconocida
fr_fr: Job inconnu
pt_pt: Job desconhecido
zh_cn: 未知Job

source: Internal error
de_de: Interner Fehler
es_es: Error interno
fr_fr: Erreur interne
pt_pt: Erro interno
zh_cn: 内部错误

source: Job started
de_de: Aufgabe gestartet
es_es: Tarea arrancada
fr_fr: Job démarré
pt_pt: Job começou
zh_cn: Job已启动

source: Read DB pending
de_de: Liest Datenbank
es_es: Lectura base de datos en curso
fr_fr: Lecture base de données en cours
pt_pt: Ser banco de dados Reprodução
zh_cn: 正在读取数据库

source: Read finished
de_de: Lesen beendet
es_es: Lectura terminada
fr_fr: Lecture terminée
pt_pt: Leitura Terminado
zh_cn: 读取已完成

source: Read canceled
de_de: Lesen abgebrochen
es_es: Lectura cancelada
fr_fr: Lecture annulée
pt_pt: Jogo cancelado
zh_cn: 读取已撤销

source: Job stacked
de_de: Druckauftrag im Stapel
es_es: Tarea apilada
fr_fr: Job empilé
pt_pt: Job empilhados
zh_cn: Job已堆放

source: Job finished
de_de: Aufgabe beendet
es_es: Tarea terminada
fr_fr: Job terminé
pt_pt: Job Concluído
zh_cn: Job已完成

source: Job failed
de_de: Aufgabe fehlgeschlagen
es_es: La tarea ha fallado
fr_fr: Le job a échoué
pt_pt: O trabalho falhou
zh_cn: 该job已失败

source: Job canceled
de_de: Aufgabe abgebrochen
es_es: Tarea cancelada
fr_fr: Job annulé
pt_pt: Trabalho cancelado
zh_cn: Job已撤销

source: Report available in storage area.
de_de: Der Bericht ist im Speicherbereich verfügbar.
es_es: El informe está disponible en el espacio de almacenamiento.
fr_fr: Le rapport est disponible dans l'espace de stockage.
pt_pt: O relatório está disponível no armazenamento.
zh_cn: 可以在存储空间中获取该报告。

source: The report could not be removed from the storage area.
de_de: Der Bericht konnte nicht aus dem Speicherbereich entfernt werden.
es_es: El informe no se ha podido borrar del espacio de almacenamiento.
fr_fr: Le rapport n'a pas pu être supprimé de l'espace de stockage.
pt_pt: O relatório não poderia ser removido do armazenamento.
zh_cn: 无法自存储空间删除该报告。

source: Report was not found in storage area.
de_de: Der Bericht wurde nicht im Speicherbereich gefunden.
es_es: El informe no se ha encontrado en el espacio de almacenamiento.
fr_fr: Le rapport n'a pas été trouvé dans l'espace de stockage.
pt_pt: O relatório não foi encontrado no espaço de armazenamento.
zh_cn: 在存储空间中未找到该报告。

source: Can't close file, fd is not valid
de_de: Datei kann nicht geschlossen werden, fd ist ungültig
es_es: Imposible cerrar el fichero. fd no es válido
fr_fr: Impossible de fermer le fichier. fd n'est pas valide
pt_pt: Não é possível fechar o arquivo. fd não é válido
zh_cn: 无法关闭该文件。 fd无效

source: file decriptor not valid - no opened file is associated
de_de: Dateideskriptor ungültig - keine geöffnete Datei ist zugeordnet
es_es: Descriptor de fichero no válido - Ningún fichero abierto asociado
fr_fr: Descripteur de fichier non valide - Aucun fichier ouvert n'est associé
pt_pt: Descritor de arquivo inválido - No arquivo aberto está associada
zh_cn: 文件描述符无效 - 没有任何打开的文件的关联的

source: 'attributes' parameter must be an array
de_de: Der Parameter 'attributes' muss ein Array sein
es_es: El parámetro 'attributes' debe ser una tabla
fr_fr: Le paramètre 'attributes' doit être un tableau
pt_pt: O parâmetro 'atributos' deve ser um array
zh_cn: 'attributes'参数必须是一个数组

source: Can't truncate, the bytes read size [{0}] doesn't corresponds to the expected size [{1}]
de_de: Abschneiden nicht möglich, die Größe der eingelesenen Bytes [{0}] stimmt nicht mit der erwarteten Größe überein [{1}]
es_es: Imposible truncar, el tamaño de los octeos leidos [{0}] no corresponde con el tamaño esperado [{1}]
fr_fr: Impossible de tronquer, la taille des octets lus [{0}] ne correspond pas à la taille attendue [{1}]
pt_pt: Não é possível truncar o tamanho de bytes lidos [{0}] não corresponde ao tamanho esperado [{1}]
zh_cn: 无法截短，读取的字节大小[{0}]与预期的大小[{1}]不相符

source: Cannot truncate, because of no read/write mode on opened file. The mode must be 'r+' or 'a+'
de_de: Abschneiden nicht möglich, da kein Lese-/ Schreibmodus für die Datei vorhanden ist. Der Modus muss 'r+' oder 'a+' sein
es_es: Imposible truncar, debido a la ausencia de modo lectura/escritura para el fichero. El modo debe ser 'r+' o 'a+'
fr_fr: Impossible à tronquer, en raison de l'absence de mode lecture/écriture pour le fichier. Le mode doit être 'r+' ou 'a+'
pt_pt: Truncar impossível, devido à ausência de modo de leitura / gravação para o arquivo. O modo deve ser de 'r' ou 'a +'
zh_cn: 无法截短，由于文件缺少读/写模式。该模式必须为'r+'或'a+'

source: File must be opened before get position.
de_de: Die Datei muss geöffnet werden, bevor die Funktion 'getPosition' aufgerufen wird.
es_es: El fichero debe estar abierto antes de llamar la función 'getPosition'.
fr_fr: Le fichier doit être ouvert avant d'appeler la fonction 'getPosition'.
pt_pt: O arquivo deve ser aberto antes de chamar a função 'getPosition.
zh_cn: 必须在调用'getPosition'函数之前打开该文件。

source: Offset [{0}] is bigger than file size [{1}].
de_de: Offset [{0}] ist größer als die Dateigröße [{1}].
es_es: El offset [{0}] es más grande que el tamaño del fichero [{1}].
fr_fr: L'offset [{0}] est plus grand que la taille du fichier [{1}].
pt_pt: Deslocamento [{0}] é maior do que o tamanho do ficheiro [{1}].
zh_cn: Offset [{0}]大于文件大小[{1}]。

source: Offset added to current position is bigger than file size.
de_de: Das zur aktuellen Position hinzugefügte Offset ist größer als die Dateigröße
es_es: El offser añadido a la posición actual es más grande que el tamaño del fichero.
fr_fr: L'offset ajouté à la position courante est plus grand que la taille du fichier.
pt_pt: O deslocamento adicionado à posição atual é maior do que o tamanho do arquivo.
zh_cn: 添加至当前位置的Offset 大于文件大小。

source: Offset can't be positive with EOF cursor.
de_de: Offset kann mit einem EOF-Cursor nicht positiv sein.
es_es: El offset no puede ser positivo en un cursor EOF.
fr_fr: L'offset ne peut-être positif sur un curseur EOF.
pt_pt: O desvio pode ser positivo apenas no slider EOF.
zh_cn: 在EOF光标上Offset不可能是正的。

source: Cursor parameter can be 0 for 'BOF', 1 for 'Current possition' or 2 for 'EOF'.
de_de: Der Parameter 'cursor' kann 0 für 'BOF', 1 für 'Aktuelle Position' oder 2 für 'EOF' sein.
es_es: El parámetro 'cursor' puede ser 0 para 'BOF', 1 para 'Posición atual' o 2 para 'EOF'.
fr_fr: Le paramètre 'cursor' peut-être 0 pour 'BOF', 1 pour 'Position courante' ou 2 pour 'EOF'.
pt_pt: O parâmetro 'cursor' pode ser 0 para 'BOF , 1 para posição comum ou 2 para EOF .
zh_cn: 'BOF'的'cursor'参数可以是0，1代表'当前位置'，或者2代表'EOF'。

source: File must be opened before seek.
de_de: Die Datei muss geöffnet sein, bevor die Funktion 'seek' aufgerufen wird.
es_es: El fichero debe estar abierto antes de llamar la función 'seek'.
fr_fr: Le fichier doit être ouvert avant d'appeler la fonction 'seek'.
pt_pt: O arquivo deve ser aberto antes de chamar a função procurar.
zh_cn: 必须在调用'seek'函数之前打开该文件。

source: File must be opened before write.
de_de: Die Datei muss geöffnet sein, bevor die Funktion 'write' aufgerufen wird.
es_es: El fichero debe estar abierto antes de llamar la función 'write'.
fr_fr: Le fichier doit être ouvert avant d'appeler la fonction 'write'.
pt_pt: O arquivo deve ser aberto antes de chamar a função de escrever.
zh_cn: 必须在调用'write'函数之前打开该文件。

source: File must be opened before flush.
de_de: Die Datei muss geöffnet sein, bevor die Funktion 'flush' aufgerufen wird.
es_es: El fichero debe estar abierto antes de llamar la función 'flush'.
fr_fr: Le fichier doit être ouvert avant d'appeler la fonction 'flush'.
pt_pt: O arquivo deve ser aberto antes de chamar a função 'rubor'.
zh_cn: 必须在调用'flush'函数之前打开该文件。

source: File must be opened before lock.
de_de: Die Datei muss geöffnet sein, bevor die Funktion 'lock' aufgerufen wird.
es_es: El fichero debe estar abierto antes de llamar la función 'lock'.
fr_fr: Le fichier doit être ouvert avant d'appeler la fonction 'lock'.
pt_pt: O arquivo deve ser aberto antes de chamar a função Lock.
zh_cn: 必须在调用'lock'函数之前打开该文件。

source: File is lock by another process.
de_de: Die Datei ist durch einen anderen Vorgang gesperrt.
es_es: El fichero está bloqueado por otro proceso.
fr_fr: Le fichier est verrouillé par un autre processus.
pt_pt: O arquivo está bloqueado por outro processo.
zh_cn: 该文件已被另一个进程锁定。

source: File can't be unlock by the process.
de_de: Die Datei kann nicht durch den Vorgang entsperrt werden.
es_es: El fichero no puede estar desbloqueado.
fr_fr: Le fichier ne peut pas être déverrouillé.
pt_pt: O arquivo não pode ser desbloqueado.
zh_cn: 无法解锁该文件。

source: Can't get error id.
de_de: Fehler-ID kann nicht aufgerufen werden.
es_es: Imposible recuperar el código de error.
fr_fr: Impossible de récupérer le code d'erreur.
pt_pt: Não é possível recuperar o código de erro.
zh_cn: 无法检索错误代码。

source: Canonical name must exist.
de_de: Kanonischer Name muss vorhanden sein.
es_es: El nombre canónico debe existir
fr_fr: Le nom canonique doit exister.
pt_pt: O nome canônico deve existir.
zh_cn: 必须有规范名称。

source: The file attribute '{0}' is not allowed.
de_de: Das Dateiattribut '{0}' ist nicht erlaubt.
es_es: El atributo de fichero '{0}' no está autorizado.
fr_fr: L'attribut de fichier '{0}' n'est pas autorisé.
pt_pt: O atributo de arquivo '{0}' não é permitido.
zh_cn: 不允许使用文件属性'{0}'。

source: The size to read can't be negative
de_de: Die Lesegröße kann nicht negativ sein
es_es: El tamaño a leer no puede ser negativo
fr_fr: La taille à lire ne peut-être negative
pt_pt: A leitura do tamanho não pode negativo
zh_cn: 待读取的大小不能为负

source: No canonical path.
de_de: Kein kanonischer Pfad.
es_es: Ningún parche canónico.
fr_fr: Aucun path canonique.
pt_pt: No caminho canônico.
zh_cn: 没有任何规范路径。

source: Too many part in canonical describer (max 6).
de_de: Zu viele Bereiche im kanonischen Deskriptor (max 6).
es_es: Demasiadas secciones en el descriptor canánico (máx 6).
fr_fr: Trop de sections dans le descripteur canonique (max 6).
pt_pt: Muitas seções do descritor canônica (máximo de 6).
zh_cn: 在规范描述中的部分过多（最大为6）。
